theblacktyper/stm32u5_custom_pcb_fw/kk_edgeai_brd_cam_bringup/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32u5xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BUTTON1_Pin GPIO_PIN_2
#define BUTTON1_GPIO_Port GPIOA
#define BUTTON2_Pin GPIO_PIN_3
#define BUTTON2_GPIO_Port GPIOA
#define CAMERA_XSDN_Pin GPIO_PIN_4
#define CAMERA_XSDN_GPIO_Port GPIOC
#define CAMERA_RSTI_Pin GPIO_PIN_5
#define CAMERA_RSTI_GPIO_Port GPIOC
#define ST7789_DC_Pin GPIO_PIN_0
#define ST7789_DC_GPIO_Port GPIOB
#define ST7789_RST_Pin GPIO_PIN_12
#define ST7789_RST_GPIO_Port GPIOB
#define ST7789_CS_Pin GPIO_PIN_15
#define ST7789_CS_GPIO_Port GPIOA
#define GRN_LED1_Pin GPIO_PIN_10
#define GRN_LED1_GPIO_Port GPIOC
#define RED_LED2_Pin GPIO_PIN_12
#define RED_LED2_GPIO_Port GPIOC

/* USER CODE BEGIN Private defines */
#define USE_RGB888
//#define USE_RGB565

// time between each capture
#define MSEC_BTWN_IMG_CAPTURES (500U)
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
